Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེའི་སེམས་ཅན་ཡོངས་སུ་གང་བ་ཐམས་ཅད་དམྱལ་བ་ཆེན་པོར་ལྷུང་ལ།
en: Imagine that all beings in all the worlds of the great trichiliocosm had fallen into the great hells.

source: དེ་ལ་སྐྱེས་བུ་གཅིག་གིས་འདི་སྐད་དུ་དེ་དག་ལ་ཁྱེད་རྣམས་མ་འཇིགས་ཤིག །ཁྱེད་རྣམས་ཀྱི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་ཀུན་སོ་སོ་ནས་ངས་བླང་ངོ་ཞེས་སྨྲས་ཏེ
en: One of them might then say, ‘All of you, do not be afraid. I will take upon myself all your suffering in these great hells.’

source: སེམས་ཅན་དེ་དག་ནི་དམྱལ་བ་ཆེན་པོ་ལས་ཐར་བ་དེ་དག་གི་དམྱལ་བའི་སྡུག་བསྔལ་ཀུན་སོ་སོར་རེ་རེ་ནས་ལོ་བརྒྱ་སྟོང་གི་བར་དུ་ལུས་ཀྱིས་བླངས་ན།
en: That being might then physically accept, for thousands of years, all the hellish suffering of the beings that had thus been freed from the great hell realms.

source: དགའ་བོ་དེ་ཁྱོད་ཀྱིས་ཡིད་ལ་ཇི་སྙམ། སྐྱེས་བུ་དེས་ཤིན་ཏུ་བདེ་བ་ཆེན་པོ་དང་ཕན་པ་ཆེན་པོ་བྱས་པ་ཡིན་ནམ།
en: Tell me Ānanda? Would that person have brought them great benefit and happiness?”

source: དགའ་བོས་གསོལ་པ།
en: Ānanda replied,

source: བཅོམ་ལྡན་འདས་དེ་ནི་ཤིན་ཏུ་ཕན་པ་ཆེན་པོ་དང་བདེ་བ་ཆེན་པོ་བགྱིས་པ་ལགས་སོ། །
en: “Blessed One,” “that person would indeed have brought them great benefit and happiness.”

source: དགའ་བོ་སྐྱེས་བུ་དེས་སེམས་ཅན་དེ་དག་དམྱལ་བ་ལས་ཕྱུང་ནས་ཀྱང་བདག་གི་མཐུ་རྩལ་གྱིས་ཐམས་ཅད་འཇིག་རྟེན་གྱི་བདེ་བ་མཆོག་དམ་པ་དང་ལྡན་པ་བྱས་ན
en: “Ānanda, imagine then that, having extricated these beings from the hells, that person independently brought them all the most sublime worldly happiness.

source: དགའ་བོ་སྐྱེས་བུ་དེས་ཤིན་ཏུ་དྲིན་གྱིས་ཕན་བཏགས་ཤིང་སེམས་ཅན་དག་ལ་ཤིན་ཏུ་བདེ་བ་བྱིན་ནམ།
en: Ānanda, would that person then have kindly benefitted these beings and brought them happiness?”

source: སྐྱེས་བུ་དེས་ཕན་པ་བགྱིས་པ་ནི་ཚིག་གིས་བརྗོད་པར་སླ་བ་མ་ལགས་སོ། །
en: “It would not be easy to verbally describe the benefit that person brought them.”

source: དགའ་བོ་ངས་དེང་བདེན་པར་གསུངས་ཏེ
en: “Ānanda, today I have spoken the truth, for

source: བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་ལ་སོགས་པས་སེམས་ཅན་ལ་ཕན་པ་དང་། བདེ་བའི་དོན་བྱས་པའི་གན་ན་སྐྱེས་བུ་དེས་ཕན་པ་དང་བདེ་བའི་དོན་བྱས་པ་ནི་རྩིས་སམ། བགྲང་བའམ། དཔེའི་བར་དུ་ཡང་ཉེ་བར་མི་འགྲོའོ། །
en: the benefit and happiness brought by such a person does not come close in terms of the measure, size, or likeness of the benefit and happiness brought to beings by the bodhisattva Bhadrapāla and the others.

source: དགའ་བོ་སྐྱེས་བུ་དེས་བདེ་བའི་ཡོ་བྱད་ཀྱིས་ཕན་པ་བྱས་པ་ནི་ཐམས་ཅད་ཀྱང་འདུས་བྱས་ཀྱི་ཆོས་དང་འབྲེལ་བ་ཡིན་པས་སྐྱོ་ཞིང་ཆོག་ཤེས་པའི་ཕྱིར་མ་ཡིན། འདོད་པ་སྤོང་བའི་ཕྱིར་མ་ཡིན། ཤེས་རབ་ཀྱི་ཕྱིར་མ་ཡིན། དགེ་སྦྱོང་གི་འབྲས་བུའི་ཕྱིར་མ་ཡིན། མྱ་ངན་ལས་འདའ་བའི་ཕྱིར་མ་ཡིན་ནོ། །
en: Ānanda, the benefit brought by that being would be in terms of material comforts, all of which are conditioned phenomena, and so they would not bring about disenchantment, contentment, the abandonment of desire, insight, the fruits of the mendicant life, or nirvāṇa.

source: དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་སེམས་ཅན་དག་ལ་ཕན་པ་དང་བདེ་བའི་དོན་བྱས་པ་ནི་བླ་ན་མེད་པའི་བདེ་བ་དང་། མཁས་པ་དག་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཚོལ་བ་ལ་མོས་པ་བྱིན་པ། སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པ། ཡང་དག་པའི་གནས་སུ་མ་ཆུད་པ་དག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ཐོབ་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བསྟན་ཅིང་གསུངས་པས་ཕན་པ་དང་དགའ་བར་འགྱུར་རོ། །
en: On the other hand, Ānanda, the benefit and happiness brought to beings by these bodhisattvas bring them unsurpassed happiness. They make the wise develop interest in pursuing the awakening of buddhahood; they perform the deeds of the buddhas; they cause the hearers and solitary buddhas—who have not yet entered the genuine abode—to attain that level; and they bring benefit and joy to bodhisattvas by teaching and instructing them through the Dharma teachings of buddhahood.

source: དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བསྟན་ཅིང་བརྗོད་དེ་ཕན་པ་དང་། དགའ་བར་བྱས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སངས་རྒྱས་ཀྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་གདུང་བསྐྱབ་ཅིང་བསྲུང་བའི་ཕྱིར་འཇིག་རྟེན་ན་གནས་སོ།
en: Ānanda, bodhisattvas remain in the world teaching and instructing, thus bringing benefit and joy to others, in order to ensure the continuity of the lineage of the Buddha, and to protect and sustain the lineage of omniscient wisdom.

source: དགའ་བོ་སྐྱེས་བུ་དེ་དག་སྔོན་འདས་པའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་བར་དུ་སངས་རྒྱས་རྒྱུན་མི་འཆད་པར་བྱེད་པ་དང་། མ་འོངས་པའི་དུས་སུ་ཡང་བསྐལ་པ་ཚད་མེད་པ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་བར་དུ་སངས་རྒྱས་རྒྱུན་མི་འཆད་པར་བྱེད་དོ། །
en: Ānanda, when these beings previously engaged in bodhisattva conduct, they ensured the continuity of the buddhas’ lineage for billions of eons, and in the future too they will ensure the continuity of the buddhas’ lineage for countless millions of eons.

source: དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སངས་རྒྱས་ཚད་མེད་པ་རྣམས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་བཙུད་དེ་
en: Ānanda, when these bodhisattvas were engaged in bodhisattva conduct in the past, they steered countless buddhas toward the awakening of buddhahood.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་རྣམས་སྐྱེ་བ་ཐམས་ཅད་དུ་ཆོས་ཡོངས་སུ་བསྐྱབས་ནས་སངས་རྒྱས་ཁྲི་ཕྲག་བརྒྱ་སྟོང་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལྷུན་གྱིས་གྲུབ་པར་བྱས་སོ། །
en: In all their lives, these bodhisattvas protected the Dharma and effortlessly accomplished the unsurpassed and perfect awakening of millions of buddhas.

source: དེ་ནས་ཡང་སེམས་ཅན་གྲངས་མེད་པ་བརྒྱ་སྟོང་རྣམས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་བཙུད་དེ་
en: They also steered countless hundreds of thousands of beings toward the awakening of buddhahood, and,

source: བསྟན་ཅིང་བསླབས་པའི་མཐུས་སངས་རྒྱས་ཀྱི་ཆོས་ཕུན་སུམ་ཚོགས་པ་ན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ། །
en: through the power of teaching and training them, they all perfected the qualities of buddhahood and fully awakened to unsurpassed and perfect buddhahood.

source: དགའ་བོ་བཟང་སྐྱོང་ལ་སོགས་པ་སྐྱེ་བོ་མང་པོ་ལ་སངས་རྒྱས་ཀྱི་བདེ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་བདེ་བ་སྟོབས་པའི་ཕྱིར་ཤིན་ཏུ་བརྩོན་འགྲུས་རྩོམ་མོ། །
en: Ānanda, Bhadrapāla and the others have exerted themselves diligently so that many beings could attain the happiness of buddhahood and omniscient wisdom.

source: དགའ་བོ་དེ་ལ་གང་ཞིག་བྱང་ཆུབ་སེམས་དཔའི་ཕ་དང་མ་ལྟ་བུ་དང་། གནས་དང་སྐྱབས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འབྱུང་གནས་གང་ཡིན་པ་བཤད་པར་འདོད་ན་
en: Ānanda, if someone wishes to teach about the support and refuge, which are like a bodhisattva’s parents, and the source of the bodhisattvas,

source: བཟང་སྐྱོང་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་པོ་ཡིན་པར་རིག་པར་བྱའོ། །
en: they must be aware of the one hundred bodhisattvas, such as Bhadrapāla.

source: དགའ་བོ་དེ་ལ་གང་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རིགས་སུ་སྐྱེ་བར་འགྱུར་ཞེས་འདྲི་ན། དེ་ལ་འདི་སྐད་དུ་བཟང་སྐྱོང་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་པོ་ཡིན་ནོ་ཞེས་བཤད་པར་བྱའོ། །
en: Ānanda, if someone asks who was born in the family of the bodhisattvas, one must reply, ‘They are the one hundred bodhisattvas, such as Bhadrapāla.’

source: དེ་ལྟར་རིགས་ཀྱི་བུ་དེ་དག་ནི་སངས་རྒྱས་ཀྱི་གདུང་རྒྱུན་མི་འཆད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་གདུང་རྒྱུན་མི་འཆད་པར་བྱེད་པའི་ཕྱིར་འཇིག་རྟེན་ན་གནས་སོ། །
en: “In this manner, these noble children stay in the world to ensure the continuity of the lineage of the buddhas, and to ensure the continuity of the lineage of omniscient wisdom.

source: རིགས་ཀྱི་བུ་དེ་དག་ལ་སོགས་པས་ཕྱི་མ་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མར་ཡང་བསྟན་ཅིང་བསླབ་པ་ལ་སྦྱོར་བའི་མཐུ་དང་བདེ་བའི་རྒྱུ་དང་རྐྱེན་གྱིས་སྐྱེ་བོ་མང་པོ་ངན་སོང་གསུམ་དུ་མི་ལྟུང་ཞིང་དེ་མ་ཡིན་པ་སེམས་ཅན་ཚད་མེད་པ་བརྒྱ་སྟོང་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་བཀོད་དོ། །
en: During the final five-hundred-year period to come, these noble children will use their power of skillful application in teaching and training, and the causes and conditions of happiness to prevent many beings from falling into the three lower realms. They will also establish countless thousands of other beings in the vehicle of the bodhisattvas.

source: དགའ་བོ་སངས་རྒྱས་བརྒྱ་སྟོང་དུ་མ་རྣམས་ཀྱིས་རིགས་ཀྱི་བུ་དེ་དག་གི་ཡོན་ཏན་བརྗོད་ཀྱང་རྫོགས་པར་མི་འགྱུར་རོ། །
en: Ānanda, even thousands of buddhas could not conclusively extol the qualities of these noble children.

source: རིགས་ཀྱི་བུ་དེ་དག་ལ་སོགས་པས་དེ་ལྟ་བུའི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པའི་ཕྱིར་རོ། །
en: Because the virtues of these noble children are unfathomable.

source: དགའ་བོ་ངས་བསྐལ་པ་གྲངས་མེད་ཚད་མེད་པ་བརྒྱ་སྟོང་གི་བར་དུ་ཆོས་ཡོངས་སུ་བསྒྲུབས་པ་རྣམས་རིགས་ཀྱི་བུ་འདི་དག་གིས་བསྲུང་ཞིང་འཛིན་པར་འགྱུར་རོ། །
en: Ānanda, these noble children will sustain and uphold the Dharma that I accomplished over thousands of countless and incalculable eons.

source: དགའ་བོ་ངས་བསྐལ་པ་ཁྲི་ཕྲག་ཚད་མེད་པའི་བར་དུ་ཆོས་དཀོན་མཆོག་བསྒྲུབས་པ་རྣམས་འདི་དག་ལ་གཏད་ཅིང་གདམས་སོ། །
en: Ānanda, I entrust them with, and instruct them in, the Jewel of the Dharma that I accomplished over countless thousands of eons.

source: རིགས་ཀྱི་བུ་འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་གྲངས་མེད་པ་ན་ད་ལྟར་བཞུགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་དགོངས་པའི་ཕྱིར་རོ། །
en: This is because these noble children are cared for by all the buddhas presently abiding in their countless and incalculable buddha realms.

source: དགའ་བོ་རིགས་ཀྱི་བུ་དེ་དག་ལ་རྟག་ཏུ་ལྷ་དང་མི་དང་འཇིག་རྟེན་དུ་བཅས་པ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བའི་གནས་ཡིན་ནོ། །
en: Ānanda, these noble children are always an object for the veneration of the world and its gods and humans.

source: དགའ་བོ་སྐྱེས་བུ་དེ་དག་ལ་ནི་ཕྱོགས་བཅུའི་སངས་རྒྱས་སྟོང་སྙེད་ཀྱང་ཆོས་གསུངས་པའི་ཚེ་རྟག་པར་བསྔགས་ཤིང་གསུངས་སོ། །
en: Ānanda, when the thousands of buddhas throughout the ten directions teach the Dharma, they praise and advise these noble children.

source: དགའ་བོ་ངས་ངེས་པར་ལུང་བསྟན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅད་པའི་ཕྱིར་གང་ཞིག་གིས་ཕྱི་མ་མ་འོངས་པའི་དུས་སུ་མདོ་སྡེ་འདི་འཆང་བ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། འདོན་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱེད་པ་དང་། གཞན་ལ་རྒྱ་ཆེར་སྟོན་ཅིང་འཆད་ན་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཤིན་ཏུ་ཉེ་བར་བསྙེན་པ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Ānanda, I prophesy that, in the future, a noble son or daughter who upholds, remembers, reads, recites, explains, or teaches it fully to others, in order to counter the doubts of all beings, be close to omniscient wisdom.

source: སྐྱེས་བུ་གང་ཞིག་ཕྱི་མ་མ་འོངས་པའི་དུས་སུ་མདོ་སྡེ་འདི་ཐོས་ནས་ཤིན་ཏུ་ཟབ་མོའི་ཆོས་འདི་ལ་དད་ཅིང་མོས་ཏེ་ཡི་དམ་བཅས་ན་ངས་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་བྱའོ། །
en: Any being who hears this discourse in the future and feels faith, interest, and commitment to this profound Dharma must be prophesied to fully awaken to unsurpassed and perfect buddhahood.

source: ཕྱི་མ་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མར་དད་ཅིང་མོས་པའི་སེམས་བསྐྱེད་དེ་བརྩོན་འགྲུས་ཤིན་ཏུ་བརྩམས་ནས་མདོ་སྡེ་འདི་བསྲུང་ཞིང་འཛིན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཆོས་ཀྱིས་གཏད་ཅིང་གདམས་སོ། །
en: Any noble son or daughter who, during the final five-hundred-year period to come, arouses an attitude of faith and inspiration, and diligently guards and retains this discourse, will be entrusted and invested by me with the Dharma of unsurpassed and perfect awakening.

source: གལ་ཏེ་ཉན་ཐོས་པ་ཞིག་གིས་ཆོས་ཟབ་མོ་འདི་དག་ལ་དད་ཅིང་ལོག་པའི་སེམས་མེད་ན་དེ་ཡང་ཕྱི་མ་མ་འོངས་པའི་དུས་སུ་སངས་རྒྱས་བྱམས་པ་དང་ཕྲད་པར་འགྱུར་རོ་ཞེས་ངས་ལུང་བསྟན་ཏོ། །
en: I prophesy that any hearer who trusts this profound Dharma and does not have wrong notions about it will meet the Buddha Maitreya in the future.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཚོལ་བ་གང་ཞིག་ཆོས་འདི་འཛིན་ཅིང་དད་ན་སངས་རྒྱས་བྱམས་པས་ལུང་བསྟན་པར་འགྱུར་ཏེ།
en: All those seeking the qualities of buddhahood who remember and trust this Dharma will receive prophecy from Buddha Maitreya;

source: སྔོན་གྱི་སྨོན་ལམ་གྱིས་རབ་ཏུ་འབྱུང་ཞིང་བྱང་ཆུབ་ཀྱི་རྒྱུད་སློབ་པར་འགྱུར་རོ། །
en: due to their past aspirations, they will take ordination and train in the lineage of awakening.

source: དགའ་བོ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ཕྱི་མ་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ་ཆོས་འདིའི་ཕྱིར་ཤིན་ཏུ་བརྩོན་འགྲུས་བསྐྱེད་ན་སྐྱེས་བུ་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཤིན་ཏུ་རྣོ་ཞིང་རྟག་པར་རིག་པར་བྱའོ། །
en: Ānanda, know that during the final five-hundred-year period to come, any noble son or daughter who gives rise to diligence for the sake of this teaching will have zealous and constant roots of virtue.”

source: སྔོན་བྱུང་བའི་བསྟན་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བཅུ་གཅིག་གོ། །།
en: This was the eleventh chapter:“ The Teaching on What Occurred in the Past .”

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་འཛིན་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva great being Lokadhara then requested the Blessed One,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་དོན་གྱི་སླད་དུ་མདོ་སྡེ་འདི་བསྐྱབ་པའི་སླད་དུ་བྱིན་གྱིས་བརླབ་ཏུ་གསོལ།
en: “Blessed One, please consecrate this discourse to protect it and bring benefit and happiness to bodhisattva great beings.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱི་མ་མ་མཆིས་པའི་དུས་སུ་མདོ་སྡེ་འདི་ཐོས་ན་
en: If bodhisattva great beings hear this discourse in the future,

source: སེམས་ཡོངས་སུ་དག་པ་དང་དགའ་བ་དང་བདེ་བར་ལྡན་ཞིང་ཆོས་འདི་དག་བསྒྲུབ་པའི་སླད་དུ་ཤིན་ཏུ་བརྩོན་འགྲུས་རྩོམ་པར་འགྱུར་རོ། །
en: their minds will become pure, joyful, and happy. They will then give rise to diligence in order to accomplish these teachings.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་མདོ་སྡེ་འདི་བྱིན་གྱིས་བརླབ་པའི་ཕྱིར་རྫུ་འཕྲུལ་གྱི་མཐུས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དྲི་དང་བསུང་ངོ་མཚར་རྨད་དང་ལྡན་པས་ཡོངས་སུ་ཁྱབ་པར་གྱུར་ཏོ། །
en: Then, as the Blessed One consecrated this discourse, he used his miraculous powers to fill the worlds of the great trichiliocosm with miraculous and incredible scents and fragrances.

source: སེམས་ཅན་རྣམས་གཅིག་ལ་གཅིག་བྱམས་པའི་སེམས་ཀྱིས་བལྟ་བར་གྱུར་ཏོ། །
en: Beings gazed upon one another with a loving attitude.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལྟར་བྱིན་གྱིས་བརླབས་ནས་འཇིག་རྟེན་འཛིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Once the Blessed One had consecrated it, he said to Lokadhara,

source: འཇིག་རྟེན་འཛིན་ངས་ཆོས་ཀྱི་ཕྱག་རྒྱའི་མདོ་སྡེ་འདི་བྱིན་གྱིས་བརླབས་པ་ནི་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅད་པའི་ཕྱིར་རོ། །
en: “Lokadhara, my consecration of this discourse on the Dharma seal serves the purpose of dispelling all doubts.

source: འཇིག་རྟེན་འཛིན་གང་ཞིག་གིས་མདོ་སྡེ་འདི་འཆང་ངམ། འཛིན་ཏམ། ཀློག་གམ། འདོན་ན་རིང་པོར་མི་ཐོགས་པར་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་སུ་འགྱུར་རོ། །
en: Lokadhara, anyone who carries, retains, reads, or recites this discourse will soon gain omniscient wisdom.

source: སྐྱེས་བུ་དེ་དག་མྱུར་དུ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྫོགས་པར་འགྱུར་བར་ལུང་བསྟན་ཏོ། །
en: I prophesy that such beings will swiftly perfect omniscient wisdom.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་གང་ཞིག་མདོ་སྡེ་ཆོས་ཀྱི་ཕྱག་རྒྱ་འདི་འཆང་ངམ། འཛིན་ཏམ། ཀློག་གམ། འདོན་ཏམ། ཡིད་ལ་བྱེད་དམ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་སྟོན་ཅིང་འཆད་ན་སྐྱེས་བུ་དེ་རིང་པོ་མི་ཐོགས་པར་མྱུར་དུ་ཕུང་པོ་ལྔ་ལ་སྦྱོར་བ་དང་། སྐྱེ་མཆེད་བཅུ་གཉིས་དང་། ཁམས་བཅྭ་བརྒྱད་དང་། རྟེན་ཅིང་འབྲེལ་ཏེ་བྱུང་བ་བཅུ་གཉིས་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་བཞི་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་དང་། འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་པའི་ཆོས་ལ་སྦྱོར་བ་ཐོབ་པར་འགྱུར་རོ། །
en: Lokadhara, any bodhisattva great being who carries, retains, reads, recites, contemplates, or teaches and explains this discourse on the Dharma seal fully to others will before long gain skill with regard to the five aggregates, the eighteen elements, the twelve sense sources, the twelve links of dependent origination, the four applications of mindfulness, the four correct exertions, the four foundations of miracles, the five powers, the five strengths, the seven aspects of awakening, the eightfold path of the noble ones, the phenomena of the world and transcendence, and conditioned and unconditioned phenomena.

source: གཞན་ཡང་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་མྱུར་དུ་ཐོབ་པར་འགྱུར། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་མྱུར་དུ་ཐོབ་པ་དང་། དྲན་པའི་སྟོབས་མྱུར་དུ་ཐོབ་པ་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པའི་ཤེས་རབ་མྱུར་དུ་ཐོབ་པ་དང་། གཞན་ཡང་ལུས་འདི་བརྗེས་ཀྱང་དྲན་པ་རྒྱུན་མི་འཆད་པ་དང་ལྡན་པ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: Furthermore, they will swiftly gain knowledge of the true characteristics of phenomena, skill in discerning the characteristics of phenomena, the power of mindfulness, insight that is skilled in discerning phenomena, unbroken mindfulness upon exchanging their bodies, and so forth, up to swiftly gaining unsurpassed and perfect awakening.

source: འཇིག་རྟེན་འཛིན་མདོ་སྡེ་འདི་ནི་ཕྱི་མ་མ་འོངས་པའི་དུས་སུ་སྐྱེ་བོ་མང་པོ་ལ་ཆོས་ཆེན་པོའི་སྣང་བ་བྱེད་ཅིང་
en: Lokadhara, in times to come, this discourse will illuminate the vast Dharma for many beings and,

source: ཡེ་ཤེས་འོད་ཀྱིས་བསོད་ནམས་ཀྱི་རྒྱུ་དང་རྐྱེན་དུ་འགྱུར་རོ། །
en: due to the light of wisdom, become the cause and condition for their merit.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: Furthermore, it will perfect the bodhisattvas’ accumulation of unsurpassed and perfect awakening.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་ཕྱི་མ་མ་འོངས་པའི་དུས་སུ་མདོ་སྡེ་འདི་འམ་མདོ་སྡེ་ཟབ་མོ་གཞན་བྱང་ཆུབ་ཀྱི་སྡེ་སྣོད་དུ་གཏོགས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་ལྡན་པ་དང་ཕྲད་ན། སྐྱེས་བུ་དེ་ལ་བདུད་ཀྱིས་བར་དུ་མི་གཅོད་ཅིང་ལས་ཀྱི་སྒྲིབ་པས་ཀྱང་བར་དུ་གཅོད་པར་མི་འགྱུར་རོ། །
en: Lokadhara, in the future, no māra or karmic obscuration will be able to obstruct any person who meets with this discourse or any of the other profound discourses containing the perfections that are included in the Bodhisattva Collection.

source: འཇིག་རྟེན་འཛིན་སྐྱེས་བུ་དེ་མ་སྐྱེས་པའི་ཆོས་ཀྱི་བཟོད་པ་མ་ཐོབ་པ་ཞིག་ན་ཡང་
en: Lokadhara, even if such people have not gained the acceptance that phenomena are unborn,

source: སངས་རྒྱས་གཉིས་སམ་སངས་རྒྱས་གསུམ་པོ་ལས་མ་སྐྱེས་པའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པར་འགྱུར་བར་ངས་ལུང་བསྟན་ཏོ། །
en: I prophesy that they will gain the acceptance that phenomena are unborn following the second or third buddha that they meet.

source: གལ་ཏེ་མ་སྐྱེས་པའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པ་ཞིག་ན་ཡང་ཆོས་ཐམས་ཅད་ལ་མྱུར་དུ་དབང་ཐོབ་པར་འགྱུར་བ་དང་། མྱུར་དུ་སངས་རྒྱས་ཀྱི་ཞིང་རྣམ་པར་དག་པ་ཐོབ་པ་དང་། མྱུར་དུ་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱི་འཁོར་ཚད་མེད་པ་ཐོབ་པ་དང་། མྱུར་དུ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཐོབ་པར་འགྱུར་རོ། །
en: If they have gained the acceptance that phenomena are unborn, they will swiftly gain dominion over all phenomena, the purification of their buddha realm, an immeasurable saṅgha of hearers, and an assembly of bodhisattvas.

source: འཇིག་རྟེན་འཛིན་ངས་མདོ་སྡེ་ཆོས་ཀྱི་ཕྱག་རྒྱ་འདི་གསུངས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཕྱི་མ་མ་འོངས་པའི་སྐྱེ་བོ་མང་པོའི་ཐེ་ཚོམ་གཅད་པའི་ཕྱིར་རོ། །
en: Lokadhara, I have taught this Dharma-seal discourse in order to dispel the doubts of all beings in the future.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཕན་པའི་དངོས་པོ་བཞི་མཐོང་བས་མ་འོངས་པའི་དུས་སུ་མདོ་སྡེ་འདི་ལ་སོགས་པ་བསྲུང་བ་དང་། འཛིན་པར་ཡི་དམ་ལེན་ཏོ། །
en: “Lokadhara, when bodhisattva great beings see the four beneficial factors related to protecting and retaining this discourse and others, they will pledge to do so in the future.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འདི་སྙམ་དུ་བདག་གིས་མྱུར་དུ་ཡོན་ཏན་ཚད་མེད་དཔག་ཏུ་མེད་པ་ཐོབ་པར་འགྱུར་སྙམ་པ་དང་། སེམས་ཅན་རྣམས་དགེ་བའི་རྩ་བ་ཆེན་པོ་སྐྱེ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་ཡང་དག་པའི་ཆོས་འཛིན་ཅིང་བསྲུང་བ་ཡིན་ནོ་སྙམ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྡེ་སྣོད་འཛིན་པ་ཡིན་ནོ་སྙམ་པ་དང་། སངས་རྒྱས་ཚད་མེད་པ་རྣམས་ཀྱིས་བསྟོད་ཅིང་བསྔགས་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་པ་དང་བཞིའོ། །
en: Bodhisattvas consider that (1) they will swiftly gain immeasurable and unfathomable virtues, (2) sentient beings will create great roots of virtue and retain and protect the genuine Dharma of the buddhas, (3) the Dharma collections of all the buddhas will be retained, and (4) they will be praised and honored by limitless buddhas.

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཁྱེད་ལ་སོགས་པས་ངས་བསྐལ་པ་གྲངས་མེད་པ་བརྒྱ་སྟོང་གི་བར་དུ་བསྒྲུབས་པའི་ཆོས་ཀྱི་དཀོན་མཆོག་གི་སྡེ་སྣོད་འདི་ལྷ་དང་མི་རྣམས་ལ་ཤིན་ཏུ་རྒྱས་པར་ཤོད་ཅིག །
en: “Lokadhara, you and other bodhisattva great beings must teach this collection of the Jewel of the Dharma, which I accomplished over hundreds of thousands of incalculable eons, extensively to gods and humans.”

source: དེའི་ཚེ་བཟང་སྐྱོང་ལ་སོགས་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then Bhadrapāla and others bowed their heads to the Blessed One’s feet and said,

source: བདག་ཅག་གི་རྔོ་ཅི་ཐོགས་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱིས་ཕྱི་མ་མ་མཆིས་པའི་དུས་སུ་ཆོས་དཀོན་མཆོག་འདི་རྒྱས་པར་སྟོན་ཅིང་བཤད་པར་འཚལ་ལོ་ཞེས་གསོལ་ཏོ། །
en: “To the best of our ability, and with the Blessed One’s blessing, we promise to teach and explain this Jewel of the Dharma fully in the future.”

source: ཆོས་ཀྱི་ཕྱག་རྒྱའི་མདོ་སྡེ་འདི་གསུངས་པའི་ཚེ་དཔག་ཏུ་མེད་ཚད་མེད་གྲངས་མེད་པ་སྙེད་ཀྱི་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་དགེ་བའི་རྩ་བ་ལྷུན་གྱིས་གྲུབ་བོ། །
en: When this Dharma-seal discourse was taught, a boundless, limitless, and countless number of bodhisattvas with just one life remaining effortlessly accomplished roots of virtue.

source: སེམས་ཅན་ཚད་མེད་པ་བརྒྱ་སྟོང་རྣམས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་གདོན་མི་ཟ་བར་ལུང་བསྟན་ཏོ། །
en: Countless hundreds of thousands of beings developed the mind directed toward unsurpassed and perfect awakening and were prophesied doubtlessly to achieve unsurpassed and perfect awakening.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་གསུངས་ནས།
en: When the Blessed One had spoken,

source: བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་འཛིན་དང་བཟང་སྐྱོང་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་དང་འཁོར་རྣམ་བཞི་དང་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་ལ་སོགས་པ་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའོ།། །།
en: all the bodhisattvas such as Lokadhara and Bhadrapāla, as well as the fourfold assembly, and all gods, humans, and asuras rejoiced in what the Blessed One had taught.

source: གདམས་པ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བཅུ་གཉིས་སོ།། །།
en: This was the twelfth chapter:“ Entrustment .”

source: འཕགས་པ་འཇིག་རྟེན་འཛིན་ཅེས་བྱ་བའི་མདོ་རྫོགས་སོ།། །།
en: This completes the Noble Sūtra “ The Inquiry of Lokadhara .”
